#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      комп
#
# Created:     26.05.2019
# Copyright:   (c) комп 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def Func(n, z=1000000):
    r = 0
    for i in range(1, n):
        s = i if i<z else z
        r = r + s

    print r         #количество возможных диалогов для n пользователей. Для 1 млн польз-лей характерно 500 млпд диалогов
                    ## для 10 тыс юзеров - 50 млн

def main():
    Func(100000, 500)

if __name__ == '__main__':
    main()
